
"""
set集合介绍:
    概述:
        它属于容器类型的一种, 其元素特点为: 无序, 唯一.
    无序解释:
        这里的无序, 并不是排序的意思, 而是: 元素的存, 取顺序不一致, 例如: 存的时候顺序是1, 2, 3, 取的时候顺序是2, 1, 3
    应用场景:
        去重.
    set集合定义格式:
        set1 = {值1, 值2, 值3...}
        set2 = set()
既打乱原排序
"""
box1={10, 20, 30, 40, 50, 60, 70, 80, 90, 100}
box2 = set(box1)
print(box2)
'''
{100, 70, 40, 10, 80, 50, 20, 90, 60, 30}

'''
box3 = {}           # 这个不是在定义集合, 而是在定义: 字典.
# 2. 打印变量的数据类型
print(type(box1))   # <class 'set'>
print(type(box2))   # <class 'set'>
print(type(box3))   # <class 'dict'>
'''
<class 'set'>
<class 'set'>
<class 'dict'>
'''
# 3. 打印元素内容.
print(f'set1: {box1}')  # set1: {2, 3, 5, 6, 'a', 10, 'c', 'b'}
print(f'set2: {box2}')  # set2: set()
print(f'set3: {box3}')  # set3: {}
print('-' * 28)
'''
set1: {100, 70, 40, 10, 80, 50, 20, 90, 60, 30}
set2: {100, 70, 40, 10, 80, 50, 20, 90, 60, 30}
set3: {}
'''