# 需求: 打印5行5列的矩形, 要求一次打印 1个*
# 方式1: 分解版.
# 打印第1行
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第2行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第3行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.

# 打印第4行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.


# 打印第5行.
j = 1
while j <= 5:
    print('*', end='')
    j += 1
print()     # 核心代码, 打印完一行之后, 记得换行.


print('-' * 28)


# 方式2: 合并版.
i = 1
while i <= 5:       # i的值: 1, 2, 3, 4, 5   外循环控制 行数.
    # 循环体, 就是具体的 打印每一行的操作.
    j = 1
    while j <= 5:   # j的值: 1, 2, 3, 4, 5  内循环控制 每行的列数
        print('*', end='')
        j += 1
    print()  # 核心代码, 打印完一行之后, 记得换行.

    i += 1       # 控制条件