# 方式2: 合并版.
i = 1
while i <= 5:       # i的值: 1,           2,          3,      4,      5   外循环控制 行数.
    # 循环体, 就是具体的 打印每一行的操作.
    j = i
    while j <= 5:   # j的值: 1,2,3,4,5    2,3,4,5     3,4,5   4,5     5 内循环控制 每行的列数
        print('*', end='')
        j += 1
    print()  # 核心代码, 打印完一行之后, 记得换行.

    i += 1       # 控制条件
"""

*****
****
***
**
*
"""

# 方式2: 合并版.
i = 1
while i <=6:
    # 打印i个空格
    j = 1
    while j <=i-1:
        print(" ", end='')
        j +=1
    # 打印5-i个星号
    k = 1
    while k <=6 -i:
        print("*", end='')
        k +=1
    print()  # 换行
    i +=1


    """
*****
****
***
**
*
*****
 ****
  ***
   **
    *

    """