# 1. 定义列表.
list0 = [10, 20, 30, 40, 50]
list1 = list0[:]
print(list1)
print(list1)
list2 = ['a', 'b', 'c']

# 2. 演示列表 增 相关的函数.
# 列表名.append(单个值 或者 列表)       在列表末尾添加元素, 如果(添加的内容)是列表, 则是把列表当做1个元素, 来添加的.
list1.append('张三')
print(list1)
list1.append(list2)
print(list1)
# 列表名.extend(列表)       在列表末尾添加元素, 如果(添加的内容)是列表, 则是把列表中逐个元素添加过来.
# list1.extend(100)       # 报错.
list1.extend(list2)       # extend('abc')           for value in 100:
print(list1)
# 列表名.insert(索引值, 要插入的元素)    在指定的位置插入元素, 如果索引不存在, 就默认往 "最后" 添加.
list1.insert(2, 100)      # 2在这里是: 正向索引.
print(list1)
list1.insert(-2, 100)     # -2在这里是: 逆向索引
print(list1)
# list1.insert(20, 666)
list1.insert(-20, 666)

# 3. 打印结果.
print(f'list1: {list1}')
print(f'list2: {list2}')
"""
[10, 20, 30, 40, 50]
[10, 20, 30, 40, 50]
[10, 20, 30, 40, 50, '张三']
[10, 20, 30, 40, 50, '张三', ['a', 'b', 'c']]
[10, 20, 30, 40, 50, '张三', ['a', 'b', 'c'], 'a', 'b', 'c']
[10, 20, 100, 30, 40, 50, '张三', ['a', 'b', 'c'], 'a', 'b', 'c']
[10, 20, 100, 30, 40, 50, '张三', ['a', 'b', 'c'], 'a', 100, 'b', 'c']
list1: [666, 10, 20, 100, 30, 40, 50, '张三', ['a', 'b', 'c'], 'a', 100, 'b', 'c']
list2: ['a', 'b', 'c']

"""